#+TITLE: SMUG : Parsing S-Expressions with Super Monadic Über Go-into

~SMUG~ itself is written using the Common Lisp style of "symbolic
expression"s. Using ~smug~ to parse ~smug~ is circular enough to be
lisp-y.

** /Parser/ ~.whitespace~

#+name: test-sexp.whitespace
#+BEGIN_SRC lisp 
  (defun .whitespace (&key (sexp *sexp*)
                           (result-type nil))
    (.first (.map result-type (.is 'member (sexp-whitespace sexp)))))
#+END_SRC

#+RESULTS: test-sexp.whitespace
: \.WHITESPACE

** /Parser/ ~|.#\\|~ : "Sharpsign Backslash"

#+BEGIN_QUOTE
*Syntax:* ~#\<<x>>~

When the token x is a single character long, this parses as the
literal character char. Uppercase and lowercase letters are
distinguished after #\; #\A and #\a denote different character
objects. Any single character works after #\, even those that are
normally special to read, such as left-parenthesis and
right-parenthesis.

In the single character case, the x must be followed by a
non-constituent character. After #\ is read, the reader backs up over
the slash and then reads a token, treating the initial slash as a
single escape character (whether it really is or not in the current
readtable).

When the token x is more than one character long, the x must have the
syntax of a symbol with no embedded package markers. In this case, the
sharpsign backslash notation parses as the character whose name is
(string-upcase x);
#+END_QUOTE

#+name: test-sexp.sharpsign-backslash
#+BEGIN_SRC lisp
  (defun |.#\\| ()
    (.let* ((sb (.string= "#\\"))
            (char 
             (.or (.prog1 (.item) (.or (.whitespace) 
                                       (.not (.item))))
                  (.first (.map 'string (.constituent))))))
      (.result (concatenate 'string sb (string char)))))
           
#+END_SRC

#+RESULTS:
: |\.

** /Parser/ ~.CONSTITUENT~

#+BEGIN_QUOTE
*constituent* /n./, /adj./ 
  1. a. /n./ :: the syntax type of a character that is part of a
     token. For details, see Section 2.1.4.1 (Constituent Characters).

     b. /adj./ (of a character) having the constituent[1a] syntax
     type.  

     c. /n./ a constituent character.
-- http://www.lispworks.com/documentation/lw60/CLHS/Body/26_glo_c.htm#constituent
#+END_QUOTE

The ~SEXP~ /struct/ says what is not a member of a sexp, so anything
that is /not not/ a member is double negatively a constituent
character.

Strangely enough, what immediately arises adds another negative. The
definition of the /Structure Class/  ~SEXP~ includes non-constituent characters
yet is itself an s-expression. As luck would have it, they are
preceeded by a ~\~ character. 

By allowing that form of escaping, the ~.CONSTITUENT~ can be ~DEFUN~'d.

#+name: test-sexp.constituent
#+BEGIN_SRC lisp
  (defun .constituent (&optional (sexp *sexp*))
   (.or (.and (.char= #\\) (.item))
        (.is-not 'member (list* (sexp-open sexp)
                                (sexp-close sexp)
                                (sexp-whitespace sexp)))))
                               
#+END_SRC

#+RESULTS:
: \.CONSTITUENT

* /Parser/ ~.CONS~

# <<.cons>>
#+name : test-sexp.cons
#+BEGIN_SRC lisp 
  (defun .cons (&optional (sexp *sexp*))
    (.let* ((car (.progn (.char= (sexp-open sexp))
                         (.sexp)))
            (dot (.optional 
                  (.progn 
                   (.whitespace)
                   (.char= (sexp-separate sexp)))))
            (cdr (.prog1 (if dot 
                             (.sexp)
                             (.first (.map 'list (.sexp) 
                                           :at-least 0)))
                         (.char= #\)))))
                 
      (.result (cons car cdr))))
#+END_SRC

#+RESULTS:
: \.CONS



